[{"anonymous": [], "word_count": "372", "_id": "551e618e79881008e3994e74", "persons": ["Mary Shaw", "Mary Shaw", "Jamie", "Lisa Ashen", "Jamie", "Lisa", "Edward", "Ella", "Jamie", "Jamie", "Mary Shaw", "Mary Shaw"], "female": ["Mary", "Mary", "Jamie", "Lisa", "Jamie", "Lisa", "Ella", "Jamie", "Jamie", "Mary", "Mary"], "pub_date": "2015-04-03T05:46:33Z", "subject": null, "organizations": ["Ravens Fair"], "news_desk": "Movies", "lead_paragraph": "Every town has its own ghost story--a local folktale that's whispered around campfires or an incantation chanted by nervous kids at a sleepover that can summon the victim of a brutal murder. And when those kids get old enough, they share the tale with the next generation, passing along the legacy of terror and keeping alive that town's own myth of massacre and the ghosts it leaves behind. Except, in some towns, those scary stories aren't just imaginative tales told to amuse adults and terrify children. Sometimes, they're real. In Ravens Fair, the story is about Mary Shaw, a ventriloquist who went mad in the 1940s. Accused of the kidnapping and murder of a young boy who labeled her a fraud, she was hunted down by angry townspeople who--in the ultimate act of revenge--cut out her tongue and killed her. They buried her along with her \"children,\" a handmade collection of vaudeville dolls, and assumed they had silenced her forever. Since that time, Ravens Fair has been plagued by mysterious deaths. The ghastly dolls from Mary Shaw's collection have gone missing from the grave and reappeared over the decades in the most unlikely of places. In the still of night--wherever her children are glimpsed--families are found gruesomely murdered--with their tongues torn out at the seam. Far from the pall of their cursed hometown, newlyweds Jamie and Lisa Ashen thought they had established a fresh start. But when his wife is grotesquely killed in their apartment, Jamie cautiously returns to Ravens Fair for the funeral, intent on unraveling the mystery of Lisa's untimely death. Once reunited with his ill father, Edward, and his father's new young bride, Ella, Jamie must dig into the town's bloody past to find out who killed his wife and why. All the while, he is doggedly pursued by a detective who doesn't believe a word of Jamie's alibi. As he uncovers the legend of Mary Shaw, the town's wayward son will unlock the story of her curse and the truth behind the threat from a rhyme in his childhood: if you see Mary Shaw and scream, she'll take your tongue. And the last thing you will hear before you die is your own voice speaking back to you.", "snippet": "Every town has its own ghost story--a local folktale that's whispered around campfires or an incantation chanted by nervous kids at a sleepover that can summon the victim of a brutal murder. And when those kids get old enough, they share the tale...", "subsection_name": null, "male": ["Edward"]}]