[{"anonymous": ["Frankie"], "word_count": "247", "_id": "550be2f57988100e8ac09e31", "persons": ["Anthony Gelati", "Alissa", "Anthony", "Anthony", "Alissa", "Vinnie", "Patty", "Anthony", "Frankie", "Alissa", "Anthony", "Claudia", "Alissa", "Anthony"], "female": ["Alissa", "Alissa", "Patty", "Alissa", "Claudia", "Alissa"], "pub_date": "2015-03-20T05:05:26Z", "subject": null, "organizations": null, "news_desk": "Movies", "lead_paragraph": "Anthony Gelati, a struggling young actor living in Venice, California, has finally landed his first major role in a movie. He races home to share the news with his live-in girlfriend Alissa who reminds him that he promised to introduce her to his family back East when he was cast in a big movie. Anthony, who is Full-Blooded Italian, has been apprehensive about bringing her home because she is African-American, something he has not yet told his family. Their celebration is interrupted by a sobering phone call when Anthony learns that his grandfather has died. Suddenly, he must return home to honor his family by attending the funeral, and, without time for explanations, bring Alissa with him to keep his promise to her. Shortly after they arrive in Providence, Rhode Island, they encounter the good-natured, yet eccentric cabby Vinnie and his pregnant girlfriend Patty. Not ready to face his family, they drive around Federal Hill, the heart of the Italian district, before stopping at the family grocery store. While there, Anthony's younger brother Frankie meets Alissa and is stunned to learn that she is his brother's girlfriend. The trio goes to the funeral home where Anthony immediately finds himself in more hot water. His mother Claudia is upset that he did not call her when he got to town and Alissa, realizing Anthony has not told his family that she is his girlfriend or that she is African-American, demands to be officially introduced at the funeral home.", "snippet": "Anthony Gelati, a struggling young actor living in Venice, California, has finally landed his first major role in a movie. He races home to share the news with his live-in girlfriend Alissa who reminds him that he promised to introduce her to his...", "subsection_name": null, "male": ["Anthony", "Anthony", "Anthony", "Vinnie", "Anthony", "Anthony", "Anthony"]}]