[{"anonymous": [], "word_count": "259", "_id": "5485ea1a7988101981f9e5df", "persons": ["Williams, Venus"], "female": ["Venus"], "pub_date": "2007-10-07T00:00:00Z", "subject": ["Tennis"], "organizations": ["Women's Tennis Assn"], "news_desk": "Sports", "lead_paragraph": "Top-seeded Venus Williams was upset by Virginie Razzano, 4-6, 7-6 (7), 6-4, in the final of the Japan Open yesterday in Tokyo.Williams had three match points in the tie breaker of the second set but could not finish off the fifth-seeded Razzano, who won her second straight WTA tournament.On the men’s side, top-seeded David Ferrer defeated Ivo Karlovic, 7-6 (3), 6-3, and will face Richard Gasquet in today’s final. Gasquet defeated second-seeded Tomas Berdych, 7-6 (3), 6-3.“I’m very happy to win,” said Razzano, who won the Guangzhou International Open last Sunday for her first WTA Tour singles title. “Venus is a great champion, she’s not in the top 10 by magic.”Williams, No. 8 in the WTA rankings, was down in the second set, 5-2, but fought back to tie, then broke Razzano to take a 6-5 lead.Razzano broke Williams to force a tie breaker, then came back from 6-3 down to win it, 9-7.Williams won the first game of the third set but took a 10-minute injury timeout and came back with her right thigh wrapped.“It started to hurt in the first set,” she said. “I wanted to play because I wanted to win, then in the third set I couldn’t get my leg up on my serve so I had to get it taped.”Both players struggled with their serves in the final set. Williams broke Razzano to tie the set 4-4 and Razzano broke Williams to take a 5-4 lead. Razzano held serve in the final game and won the match when Williams’s return went into the net.", "snippet": "Top-seeded Venus Williams was upset by Virginie Razzano, 4-6, 7-6 (7), 6-4, in the final of the Japan Open yesterday in Tokyo.Williams had three match points in the tie breaker of the second set but could not finish off the fifth-seeded Razzano, who...", "subsection_name": "Tennis", "male": []}]