[{"anonymous": [], "word_count": "280", "_id": "548c081579881004157bc588", "persons": ["Bonds, Barry"], "female": [], "pub_date": "2007-07-01T00:00:00Z", "subject": ["Baseball"], "organizations": ["Diamondbacks", "National League", "Giants"], "news_desk": "Sports", "lead_paragraph": "Barry Bonds hit his 750th career home run, an inning after getting a startling hug from a fan in a 4-3, 10-inning loss to Arizona on Friday night in San Francisco. The homer moved Bonds five away from tying Hank Aaron’s record, but Miguel Montero hit a solo homer off Brad Hennessey (1-3) in the 10th for the Diamondbacks and San Francisco lost its third straight.“Everybody in that clubhouse knows he’s going to get a lot of attention reaching this milestone, as he should,” Giants Manger Bruce Bochy said. “It’s going to be a big moment in baseball. Right now, we’re all embarrassed with where we’re at, how we’re playing, things that are happening on the field.”Bonds, 42, led off the eighth with a solo shot off Liván Hernández to tie the score, 3-3. The homer came an inning after a fan hopped a fence and ran out to Bonds in left field. Bonds, a seven-time National League most valuable player, calmly greeted the man and walked him off and into the custody of security personnel.The fan came out over the fence along the left-field line and scurried to Bonds while Orlando Hudson was batting. Bonds did not flinch, putting his arm around the man and walking him off the field — and fans began chants of “Barry! Barry!”“He just wanted to shake my hand,” Bonds told MLB.com while quickly leaving the ballpark. “I told him to come with me so he didn’t get into any more trouble.”The Giants said the man, in the custody of the San Francisco police, would face charges of public drunkenness and interfering with a sporting event. His name and age were not immediately available.", "snippet": "Barry Bonds hit his 750th career home run, an inning after getting a startling hug from a fan in a 4-3, 10-inning loss to Arizona on Friday night in San Francisco. The homer moved Bonds five away from tying Hank Aaron’s record, but Miguel Montero...", "subsection_name": "Baseball", "male": ["Barry"]}]