[{"anonymous": [], "word_count": "349", "_id": "548ce1ec798810543aba4c16", "persons": ["Lewis Hamilton", "Hamilton", "Hamilton", "Hamilton", "Ron Dennis", "Dennis", "Dennis", "Kimi Raikkonen"], "female": ["Kimi"], "pub_date": "2007-07-22T00:00:00Z", "subject": null, "organizations": ["McLaren", "McLaren", "McLaren"], "news_desk": "Sports", "lead_paragraph": "Lewis Hamilton, the Formula One championship leader, appeared to escape serious injury when he crashed into a wall during qualifying yesterday for the European Grand Prix in Nürburgring, Germany.Hamilton waved and flashed a thumbs-up sign from a stretcher before being taken by ambulance from the track. Officials said he was conscious and speaking on the way to the circuit’s medical center.Hamilton, an Englishman, hit the wall hard after the right-front wheel of his McLaren was damaged.“I’m absolutely fine and we will see later if I am able to race tomorrow,” Hamilton said in a statement released by McLaren. “Everybody has been looking after me really well. We know what caused the accident and I’m just pleased that everything is O.K., and I really hope I can race tomorrow.”McLaren officials said Hamilton had not broken any bones and would be kept under observation in a military hospital in nearby Koblenz for several hours. If Hamilton races, he would start from 10th on the grid.“It’s far too early to say, but at the moment he doesn’t appear to have pain anywhere, no broken bones,” the team leader Ron Dennis said. “We won’t be able to decide until after a few hours’ observation, but so far, so good.”Dennis said the crash was caused by the “failure of the right-hand wheel gun, so effectively the wheel wasn’t properly put on.”“At least we know we don’t have a problem with the car,” Dennis said.The qualifying session was stopped with 5 minutes 31 seconds remaining, and it took about 30 minutes for the session to resume.“Sometimes it’s difficult to wait, you have to be patient and do the best you can when you go out again,” said Kimi Raikkonen, who grabbed his second pole of the season and 13th of his career.Raikkonen, a driver for Ferrari who is coming off two consecutive wins, drove the fastest lap on the 3.2-mile", "snippet": "Lewis Hamilton, the Formula One championship leader, appeared to escape serious injury when he crashed into a wall during qualifying yesterday for the European Grand Prix in Nürburgring, Germany.Hamilton waved and flashed a thumbs-up sign from a...", "subsection_name": "More Sports", "male": ["Lewis", "Hamilton", "Hamilton", "Hamilton", "Ron", "Dennis", "Dennis"]}]