[{"anonymous": ["Villanueva", "Skiles", "Villanueva"], "word_count": "234", "_id": "54686fe679881054c64b11b6", "persons": ["Carl Landry", "Landry", "Landry", "Landry", "Landry", "Landry", "Charlie Villanueva", "Scott Skiles", "Villanueva", "Charlie", "Skiles", "Villanueva"], "female": [], "pub_date": "2009-03-18T00:00:00Z", "subject": ["Automobiles", "Accidents and Safety", "Shooting (Sport)", "Basketball"], "organizations": ["Houston Rockets"], "news_desk": "Sports", "lead_paragraph": "Houston Rockets forward Carl Landry was shot in the leg about 2:30 a.m. Tuesday, a few hours after the Rockets returned from a 95-84 victory in New Orleans. The Houston police said Landry, 25, was driving his sport utility vehicle southbound on a city street, when a northbound car swerved into his path and collided with his vehicle. Landry and the driver of the other vehicle made U-turns, the vehicles collided again and Landry’s S.U.V. hit a utility pole. The police said Landry got out of his S.U.V. to inspect the damage, and was shot by one of the two occupants of the car. The suspects then fled the scene, while Landry ran to get help, the police said. Landry was expected to be out one to three weeks. shooting ¶Milwaukee Bucks forward Charlie Villanueva got a talking-to from Coach Scott Skiles after he learned Villanueva posted a message to his Twitter feed from his mobile phone during halftime of Sunday’s home victory over Boston. “We made a point to Charlie and the team that it’s nothing we ever want to happen again,” Skiles said. Using the screen name CV31 — Villanueva’s initials and jersey number — Villanueva, who had a team-high 19 points, posted the following message: “In da locker room, snuck to post my twitt. We’re playing the Celtics, tie ball game at da half. Coach wants more toughness. I gotta step up.” Twitter.", "snippet": "Houston Rockets forward Carl Landry was shot in the leg about 2:30 a.m. Tuesday, a few hours after the Rockets returned from a 95-84 victory in New Orleans. The Houston police said Landry, 25, was driving his sport utility vehicle southbound on a...", "subsection_name": null, "male": ["Carl", "Landry", "Landry", "Landry", "Landry", "Landry", "Charlie", "Scott", "Charlie"]}]