[{"anonymous": ["Foote", "Foote", "Timmons", "Foote", "DeCamillis", "Gaither"], "word_count": "200", "_id": "546a36377988106d5f6262a7", "persons": ["Larry Foote", "Foote", "Foote", "Lawrence Timmons", "Timmons", "Foote", "Joe DeCamillis", "Rich Behm", "Greg Gaither", "DeCamillis", "Gaither"], "female": [], "pub_date": "2009-05-05T00:00:00Z", "subject": ["Football", "Trades (Sports)"], "organizations": ["Pittsburgh Steelers"], "news_desk": "Sports", "lead_paragraph": "The Pittsburgh Steelers released inside linebacker Larry Foote, a move expected since Foote asked to be traded or cut. Foote had started every Steelers game the past five seasons, including their Super Bowl victories last season and after the 2005 season. But he was unhappy with coming off the field on passing downs for Lawrence Timmons, a 2007 first-round draft pick. With Timmons ready to start, Foote told the Steelers last week that he wanted to be traded or released. The Steelers cut him after failing to find a team willing to deal a draft pick for him. ¶Government investigators began sorting through the Dallas Cowboys’ flattened practice facility, trying to figure out why fierce winds sent the tentlike structure crashing down during a rookie workout session. Twelve people were hurt, including the special teams coach Joe DeCamillis, who underwent surgery Monday to stabilize a fractured vertebra in his neck. The most seriously injured was Rich Behm, the team’s 33-year-old scouting assistant, who was permanently paralyzed from the waist down after his spine was severed. The assistant athletic trainer Greg Gaither, 35, had surgery on his fractured right leg. DeCamillis and Gaither were expected to leave the hospital this week. collapse.", "snippet": "The Pittsburgh Steelers released inside linebacker Larry Foote, a move expected since Foote asked to be traded or cut. Foote had started every Steelers game the past five seasons, including their Super Bowl victories last season and after the 2005...", "subsection_name": "Pro Football", "male": ["Larry", "Lawrence", "Joe", "Rich", "Greg"]}]