[{"anonymous": ["Chizik", "Chizik", "Wheaton"], "word_count": "201", "_id": "547b29757988101f1558b5ee", "persons": ["Jamie Pollard", "Chizik", "Chizik", "Eric Ward", "Joe Stewart", "Greg Dillon", "Ted Schlafke", "Nate Kmic", "Wheaton", "Danny Woodhead", "Mary Hardin-Baylor"], "female": ["Jamie", "Nate", "Mary"], "pub_date": "2008-12-14T00:00:00Z", "subject": ["College Athletics", "Football"], "organizations": ["Iowa States Gene Chizik", "AP", "Grambling State", "Jackson State", "Southwestern Athletic Conference", "N.C.A.A.", "Northwest Missouri State", "Chadron State", "Mount Union", "AP"], "news_desk": "Sports", "lead_paragraph": "Auburn has hired Iowa State’s Gene Chizik as its coach. Jamie Pollard, Iowa State’s athletic director, said Chizik told him Saturday that he had accepted the job. Chizik was 5-19 in two seasons after stints running the defenses at Auburn and Texas. ¶Eric Ward threw a 13-yard touchdown pass to Joe Stewart with 14 seconds left to give Richmond a 21-20 victory over Northern Iowa in Cedar Falls, Iowa, sending the Spiders to the Football Championship Subdivision title game. Richmond will play Montana on Friday night. richmond (AP)¶Greg Dillon threw for three touchdowns and rushed for one as Grambling State defeated Jackson State, 41-9, in the Southwestern Athletic Conference title game in Birmingham, Ala. swac ¶Ted Schlafke threw for two touchdowns to lead Minnesota Duluth to its first N.C.A.A. Division II football title with a 21-14 win over Northwest Missouri State in Florence, Ala. duluth ¶Nate Kmic gained 310 yards and became college football’s career rushing leader as Mount Union beat Wheaton, 45-24, in the Division III semifinals. He has 7,986 career yards, 24 more than Danny Woodhead had at Chadron State from 2004 to 2007. Next Saturday, Mount Union will face Wisconsin-Whitewater, which beat Mary Hardin-Baylor by 39-13. div3 (AP).", "snippet": "Auburn has hired Iowa State’s Gene Chizik as its coach. Jamie Pollard, Iowa State’s athletic director, said Chizik told him Saturday that he had accepted the job. Chizik was 5-19 in two seasons after stints running the defenses at Auburn and...", "subsection_name": "College Football", "male": ["Eric", "Joe", "Greg", "Ted", "Danny"]}]