[{"anonymous": ["Schnittker", "Schnittker", "Schnittker", "Schnittker"], "word_count": "206", "_id": "54759b95798810593e50e753", "persons": ["Ray Schnittker", "Schnittker", "Schnittker", "Schnittker", "Janet Durso", "John Egloff", "Schnittker", "William S. Farish Jr."], "female": ["Janet"], "pub_date": "2008-12-18T00:00:00Z", "subject": ["Horse Racing"], "organizations": ["Vieux Carre Farm"], "news_desk": "Sports", "lead_paragraph": "The standout trotter Deweycheatumnhowe and the award-winning trainer and co-owner Ray Schnittker were unhurt when their pickup and trailer flipped on an icy road in north-central Pennsylvania. Schnittker said his truck hit an icy patch near Jersey Shore, Pa. The truck and trailer carrying the Hambletonian champion called Dewey by Schnittker flipped and slid about 30 feet down an embankment. Schnittker was unhurt in the crash, but his wife, the veterinarian Janet Durso, hurt her shoulder. Dr. John Egloff of Vieux Carre Farm in Gettysburg, where Deweycheatumnhowe was taken after the accident, said the horse sustained minor abrasions. Schnittker and the trotter were on their way to Lexington, Ky. ¶The Breeders’ Cup has reversed its decision to cut financial support for certain stakes races at about 40 North American tracks after getting a barrage of complaints from the industry. While the organization is making no long-term commitment to the stakes program, which currently affects 121 races, it announced that it would continue at least for one more year. William S. Farish Jr., the Breeders’ Cup chairman, said the organization would tap into its reserve funds to contribute the $4.5 million that it announced last week would be cut from the program because of budget concerns. cup.", "snippet": "The standout trotter Deweycheatumnhowe and the award-winning trainer and co-owner Ray Schnittker were unhurt when their pickup and trailer flipped on an icy road in north-central Pennsylvania. Schnittker said his truck hit an icy patch near Jersey...", "subsection_name": "More Sports", "male": ["Ray", "John", "William"]}]