[{"anonymous": [], "word_count": "222", "_id": "5477b9e679881006dca8b1c4", "persons": ["Baeza, Braulio", "Spitzer, Eliot L"], "female": [], "pub_date": "2008-09-10T00:00:00Z", "subject": ["Horse Racing"], "organizations": ["New York Racing Assn"], "news_desk": "Sports", "lead_paragraph": "The Hall of Fame jockey Braulio Baeza and the former racing official Mario Sclafani filed a $100 million civil suit against former Gov. Eliot Spitzer, the New York Racing Association and several others. The suit, filed in United States District Court for the Eastern District of New York, claims the defendants participated in a conspiracy to violate the civil rights of Baeza and Sclafani and includes accusations of false arrest, false imprisonment, malicious prosecution, defamation and a conspiracy in violation of constitutional rights. Baeza and Sclafani were racing officials working in the jockeys’ quarters at Belmont Park when they were arrested Sept. 21, 2005, and charged with falsely reporting the weights of several riders and, therefore, defrauding the betting public. The case was thrown out in September 2007. ¶A sluggish market continued through the second session of Keeneland’s September yearling sale, with fewer horses than usual fetching high prices. For the second consecutive day, a sheik paid the session’s high price for a yearling by the leading sire A. P. Indy. Sheik Hamdan bin Rashid al Maktoum’s Shadwell Stable spent the session’s high of $1.5 million for a bay colt out of Taegu. A day earlier, his brother, Sheik Mohammed bin Rashid al Maktoum — the ruler of Dubai — spent $3.1 million on a filly, also by A. P. Indy.keeneland (AP).", "snippet": "The Hall of Fame jockey Braulio Baeza and the former racing official Mario Sclafani filed a $100 million civil suit against former Gov. Eliot Spitzer, the New York Racing Association and several others. The suit, filed in United States District Court...", "subsection_name": "More Sports", "male": ["Braulio", "Eliot"]}]