[{"anonymous": [], "word_count": "221", "_id": "546983267988101de50ecd91", "persons": ["Auriemma, Geno", "Calipari, John", "Bartow, Gene"], "female": [], "pub_date": "2009-04-16T00:00:00Z", "subject": ["Olympic Games (2012)", "College Athletics", "Basketball"], "organizations": ["University of Kentucky", "Memphis Grizzlies", "University of California, Los Angeles"], "news_desk": "Sports", "lead_paragraph": "Geno Auriemma, the Connecticut women’s coach, said he would continue to coach the Huskies while also taking over the United States women’s team. Auriemma was introduced as the national team coach for the next three years, through the 2012 Olympics in London. Auriemma, 55, just guided Connecticut to its sixth national championship and third perfect season. He is the first active college coach to head a women’s Olympic team since Tara VanDerveer led the 1996 team to a gold medal in Atlanta. ¶Forward DeMarcus Cousins signed a national letter of intent to play at Kentucky, the first one secured by the new coach, John Calipari. Cousins had previously committed to play for Calipari at Memphis, but is joining the Wildcats because Calipari was hired earlier this month to replace Billy Gillispie. Along with Cousins, Kentucky announced Jon Hood of Madisonville, Ky., and Daniel Orton of Oklahoma City as members of the signing class. kentucky ¶The former U.C.L.A. and Alabama-Birmingham coach Gene Bartow has received a diagnosis of stomach cancer. Bartow, 78, the president of the company that owns the N.B.A.’s Memphis Grizzlies, will begin outpatient treatment at the Kirklin Clinic in Birmingham next week, U.A.B. said. Bartow succeeded John Wooden as U.C.L.A.’s coach in 1976 and led the Bruins to the Final Four. He left after two seasons to start Alabama-Birmingham’s program. bartow.", "snippet": "Geno Auriemma, the Connecticut women’s coach, said he would continue to coach the Huskies while also taking over the United States women’s team. Auriemma was introduced as the national team coach for the next three years, through the 2012...", "subsection_name": "College Basketball", "male": ["Geno", "John", "Gene"]}]