[{"anonymous": ["Electric", "Electric"], "word_count": "229", "_id": "5555b4627988100887cc2bc7", "persons": ["Max", "Max", "Max", "Max", "Electric", "Max", "Electric", "Max"], "female": [], "pub_date": "2015-05-15T04:54:31Z", "subject": null, "organizations": null, "news_desk": "Movies", "lead_paragraph": "Sometimes the most amazing superheroes are the ones inside your dreams. So discovers ten-year-old Max, an outcast little boy who has become lost in his own fantasy world in an attempt to escape the everyday worries of dealing with parents, school bullies and no-fun summer vacations. But when Max realizes the cool characters, high-flying adventures and incredible secret powers that dwell in his imagination might be far more real than anyone is willing to believe, his whole world changes. Now, Max is blasting off on a mission to Planet Drool where Sharkboy--a kid once lost at sea and raised under the watchful fins of sharks only to become half-shark--and Lavagirl--a volcanic beauty who emits leaping flames and red-hot rocks--live in a realm of astonishing wonders, one in which the Train of Thought can whisk you off to the mouth-watering Land of Milk and Cookies. Teeming with mountainous roller coasters and violet skies, Planet Drool looks like the perfect kid paradise until Max meets up with the shocking Mr. Electric and his sidekick Minus who are trying to do away with all dreams forever. With Sharkboy and Lavagirl in trouble, only Max can guide them--by imagining every clever move of their wily escape from Mr. Electric's Lair. Speedily conjuring up an incredible array of gadgets, gizmos, contraptions and cool ideas, Max learns the power of turning his dreams into reality.", "snippet": "Sometimes the most amazing superheroes are the ones inside your dreams. So discovers ten-year-old Max, an outcast little boy who has become lost in his own fantasy world in an attempt to escape the everyday worries of dealing with parents, school...", "subsection_name": null, "male": ["Max", "Max", "Max", "Max", "Max", "Max"]}]